In [2]:
import pandas as pd
import numpy as np
import datetime

# Oridinal number encoding

In [4]:
today = datetime.datetime.today()
today

datetime.datetime(2021, 8, 16, 19, 17, 29, 250535)

In [5]:
delta = datetime.timedelta(3)
delta

datetime.timedelta(days=3)

In [6]:
today-delta

datetime.datetime(2021, 8, 13, 19, 17, 29, 250535)

In [8]:
## get last 15 days
data = [today-datetime.timedelta(x) for x in range(0,15)]

In [10]:
data

[datetime.datetime(2021, 8, 16, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 15, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 14, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 13, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 12, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 11, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 10, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 9, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 8, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 7, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 6, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 5, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 4, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 3, 19, 17, 29, 250535),
 datetime.datetime(2021, 8, 2, 19, 17, 29, 250535)]

In [11]:
data = pd.DataFrame(data)

In [12]:
data.head()

                           0
0 2021-08-16 19:17:29.250535
1 2021-08-15 19:17:29.250535
2 2021-08-14 19:17:29.250535
3 2021-08-13 19:17:29.250535
4 2021-08-12 19:17:29.250535

In [15]:
data.columns = ["days"]

In [16]:
data.head()

                        days
0 2021-08-16 19:17:29.250535
1 2021-08-15 19:17:29.250535
2 2021-08-14 19:17:29.250535
3 2021-08-13 19:17:29.250535
4 2021-08-12 19:17:29.250535

In [24]:
data["weekday"] = data["days"].dt.day_name()
data.head()

                        days   weekday
0 2021-08-16 19:17:29.250535    Monday
1 2021-08-15 19:17:29.250535    Sunday
2 2021-08-14 19:17:29.250535  Saturday
3 2021-08-13 19:17:29.250535    Friday
4 2021-08-12 19:17:29.250535  Thursday

In [23]:
data.head()

                        days   weekday
0 2021-08-16 19:17:29.250535    Monday
1 2021-08-15 19:17:29.250535    Sunday
2 2021-08-14 19:17:29.250535  Saturday
3 2021-08-13 19:17:29.250535    Friday
4 2021-08-12 19:17:29.250535  Thursday

In [26]:
dictionary = {"Monday":1,"Tuesday":2,"Wednesday":3,"Thursday":4,"Friday":5,"Saturday":6,"Sunday":7}
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [28]:
data["weekday_rank"] = data["weekday"].map(dictionary)
data.head()

                        days   weekday  weekday_rank
0 2021-08-16 19:17:29.250535    Monday             1
1 2021-08-15 19:17:29.250535    Sunday             7
2 2021-08-14 19:17:29.250535  Saturday             6
3 2021-08-13 19:17:29.250535    Friday             5
4 2021-08-12 19:17:29.250535  Thursday             4

# Count or Frequency Encoding

In [35]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [40]:
cols = [1,3,5,6,7,8,9,13]
df2 = df[cols]

In [41]:
df2.dtypes

1     object
3     object
5     object
6     object
7     object
8     object
9     object
13    object
dtype: object

In [42]:
df2.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [43]:
df2.columns = ["Employment","Degree","Status","Designation","Role","Race","Gender","Country"]
df2.head()

,Employment,Degree,Status,Designation,Role,Race,Gender,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [47]:
# let us take unique labels in each feature/columns
for feature in df2.columns:
    print(feature," : ",len(df2[feature].unique()),"labels")

Employment  :  9 labels
Degree  :  16 labels
Status  :  7 labels
Designation  :  15 labels
Role  :  6 labels
Race  :  5 labels
Gender  :  2 labels
Country  :  42 labels

In [50]:
dictionary = df2["Country"].value_counts().to_dict()
dictionary

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Trinadad&Tobago': 19,
 ' Cambodia': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Hungary': 13,
 ' Honduras': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [51]:
# replace the country name with the counts
df2["Country_Encoding"] = df2["Country"].map(dictionary)
df2.head()

<ipython-input-51-7fb0a375ac36>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Country_Encoding"] = df2["Country"].map(dictionary)

,Employment,Degree,Status,Designation,Role,Race,Gender,Country,Country_Encoding
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,95

### Advantage:
1. easy to use

### Disadvantage:
1. same weight if frequenecy of different labels are same

# Target guided ordinal encoding

Ordering the labels according to the output

In [65]:
df=pd.read_csv("titanic_train.csv",usecols=["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [66]:
df.Cabin.fillna("Missing",inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [68]:
df["Cabin"]=df.Cabin.astype(str).str[0]

In [74]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [76]:
# calcualting the survival rate based on cabin  --- Here we doing the target eccoding => as survived is our target
df.groupby("Cabin")["Survived"].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [77]:
survival_list = df.groupby("Cabin")["Survived"].mean().sort_values().index
survival_list

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [80]:
# assigning rankes to cabin based on survival mean
survival_cabin = {k:i for i,k in enumerate(survival_list,0)}
survival_cabin

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [81]:
# map cabin values with survival_cabin
df["Cabin"]=df["Cabin"].map(survival_cabin)
df.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

# Mean encoding -  based on target

In [83]:
mean_dict=df.groupby("Cabin")["Survived"].mean().sort_values().to_dict()
mean_dict

{0: 0.0,
 1: 0.29985443959243085,
 2: 0.4666666666666667,
 3: 0.5,
 4: 0.5932203389830508,
 5: 0.6153846153846154,
 6: 0.7446808510638298,
 7: 0.75,
 8: 0.7575757575757576}

In [84]:
df["cabin_mean_encoding"]=df["Cabin"].map(mean_dict)
df.head()

   Survived  Cabin  cabin_mean_encoding
0         0      1             0.299854
1         1      4             0.593220
2         1      1             0.299854
3         1      4             0.593220
4         0      1             0.299854